[
    {
        "id": "c6f216e7-5e4a-4e7f-9a92-679b7b8049aa",
        "title": "5 Principles to Become a Better Developer",
        "desc": "If you are a self-taught developer like me, then chances are you learned everything about being a developer online — whether it was through Bootcamp, Google, Stack Overflow, Udemy, or any other online platform that offers cheap or even free courses and resources.\r\nHowever, you can never become as good a developer as you want to be if you don’t understand the concepts, fundamentals, and ways of thinking that are taught only in an academic setting.\r\nAside from the diploma and credentials, this is probably the only difference between self-taught developers and computer science graduates. It makes all the difference, though — not just the title itself but also in regard to confidence and growth. As such, it is important for self-taught developers to not just learn the technical side of things but also the principles, the techniques, and the perspectives because if you want to become a real developer, then you need to start thinking like a real developer.\r\n\r\nBefore You Start Coding, Keep in Mind That Computers Are Dumb\r\nAt the end of the day, they are just tools.\r\nAs you learn to program, you will realize that computers are dumb. You need to tell them everything that you want to happen, step by step, detail by detail, word for word.\r\nSo before you start coding, imagine this conversation:\r\nA person approaches you and asks, “Do you know where 221B Baker Street is?”\r\nYou answer with these directions: “Go to that street and turn right, and as soon as you reach the second traffic light, you have to go left. Once you see a cafe with a green door, there’s a small shortcut in there. Take it, and at the end of that road, you will see 221B Baker Street.”\r\nThe person just stares at you and says, “I was just asking if you know where it is. I didn’t ask for directions — just a yes or no.”\r\nThis was just some silly example I came up with. The takeaway is that you need to always be aware as you code that computers are dumb. They will follow everything you write, all the instructions, word for word, so make sure that all your logic makes sense and the structure is correct.",
        "author": "Jakhongir",
        "date": "2021/4/7"
    }
]